import time
import os
import random
import pystyle
from pystyle import Colors, Box, Write, Center, Colorate

os.system("pip install pystyle")

def mastur_1():
	pystyle.Write.Print('''Почему мастурбация — это безопасно и даже полезно?
Никто про нее не говорит, но все ею занимаются. Что это такое? Правильно — мастурбация. Не знаю, в какой исторический момент исследование своего тела вдруг стало «опасным рукоблудием», но эти запреты наложили огромный отпечаток на женскую сексуальность. Тысячи моих учениц приходят на курс интимной гимнастики с четкой установкой, что вагина — срамное место, что трогать себя — неприлично. Было такое, что девочки не могли переступить психологический барьер и вставить палец в вагину. Но ведь ничего плохого в этом нет, и ваше тело прекрасно все целиком: вагина — это не грязно, трогать вульву — можно и нужно, исследовать свое тело — это приятно, и никто не имеет права вам это запрещать.

Мастурбация по сути — это такой же секс, только с самым дорогим человеком на свете — с самим собой. Когда вы принимаете эту истину, все меняется — ваше восприятие процесса, своего тела. У солосекса множество плюсов. Например, во время мастурбации выделяются эндорфины в большом количестве. Они снижают уровень стресса и улучшают настроение. Также он помогает снизить болевые ощущения во время менструации. Неожиданный бонус от мастурбации — крепкий сон. Она дает приятную усталость и запускает выработку гормона пролактина. Все вместе это помогает окончательно расслабиться и заснуть. А еще мастурбация — это очень увлекательно, если подойти к ней творчески.

[Сколько нужно мастурбировать?]

Здесь четкой дозировки нет, все-таки мы не в аптеке. Главное, чтобы мастубрация не мешала вашей сексуальной жизни с партнером. Я говорю о ситуации, когда мастурбацией вы заменяете традиционные ласки и не можете получить оргазм со своим мужчиной.

[Чем мастурбировать?]

Здесь, конечно, кто во что горазд. Любители классики никак не могут отойти от пальчиковой стимуляции. Отговаривать не буду, дам одну рекомендацию: добавьте к солосексу смазку, особенно с разогревающим эффектом, или попробуй жидкий вибратор. Тогда ощущения усилятся, и будет мощный оргазм.
Если вы великий экспериментатор — задействуйте секс-игрушки. С их помощью вы можете усиливать или снижать напряжение, останавливать или возобновлять стимуляцию, растягивать удовольствие или сделать оргазм стремительным.
Душ — самый плохой вариант из всех. Но, по моей статистике, более 80% женщин прошли через такой вид мастурбации. Плох этот вариант тем, что притупляет чувствительность, а еще если вы направляете струю в сторону вагины, то вода может попасть внутрь, и микрофлора нарушится.
Еда, самоделки — ими мастурбировать нельзя. Они могут нарушить микрофлору влагалища и травмировать слизистую. Также категорически запрещено мастурбировать деревянными расческами, пылесосом, электробритвой. Соблюдайте меры безопасности и не рискуйте своим здоровьем.

[Как мастурбировать?]

Разнообразно. Когда вы маструбируете однообразно, у вас выстраиваются нейронные связи, которые в будущем могут помешать вам получить оргазм с мужчиной или в другой позе, от другого типа стимуляции. Чтобы этого не случилось, меняйте силу стимуляции, задействуйте разные эрогенные зоны, ласкайте тело в разных позах — стоя или сидя, лежа на боку, на животе. Не ограничивайте свою фантазию
Громко. Позвольте эмоциям выйти наружу, ведь стоны только усиливают возбуждение.
Просматривая порно. Или после чтения эротической литературы. В общем, не бойтесь подключать сторонние возбудители.
Перед мужчиной. Когда не можете объяснить словами, какие ласки вам нравятся, попробуйте мастурбацию. Это очень возбуждает, делает вас ближе и настраивает на эксперименты в постели.
Также вы можете попробовать устроить для себя сеанс терапевтической мастурбации. Если вы никогда не получали оргазм и никогда не мастурбировали, эта практика поможет вам справится со стеснением и разбудит вашу сексуальную жизнь.Создайте максимально комфортные условия. Будьте уверены, что у вас есть минимум 30 минут, когда никто не позвонит, не придет — в общем, не будет мешать вам познавать свое тело.
Прикасайтесь к своему телу и фиксируйте ощущения, которые испытываете. Начните со ступней, прикасайтесь к ногам, рукам, шее и коже головы. Если вы никогда не испытывали оргазм — то остановитесь на этом этапе. Проделывайте это упражнение раз в неделю и не менее 30 минут. Постепенно переходите к более пикантным ласкам: начните прикасаться к груди, низу живота, внутренней поверхности бедер.
Теперь переходите к непрямой стимуляции клитора. Для начала можете просто подумать о нем. Потом попробуйте подвигать бедрами вперед и назад или по кругу. Постарайтесь относится к телу и клитору особенно, с мягким понимаем.
Когда почувствуете, что готовы — переходите к непрямой стимуляции. Для этого осторожно сожмите половые губы между большим и указательным пальцами, потяните их наружу, потом из стороны в сторону. Так вы воздействуете на клитор, не прикасаясь при этом к нему.
Накройте ладонью лобок, прижмите и подвигайте вниз и вверх по направлению к животу. Это снова создаст мягкое давление на клитор. Попробуйте надавливать с разной силой, двигать рукой с разной скоростью или в разном направлении, например, по кругу.
Положите ладони на внутреннюю поверхность бедер, так чтобы края больших пальцев прижимались к половым губам. Потритесь бедрами о свои ладони.
Эта практика станет первым шагом к полноценному солосексу и откроет вам мир ярких регулярных оргазмов.\n''', Colors.red_to_yellow, interval=0.001)


def mastur_2():
	pystyle.Write.Print('''Не у каждого мужчины есть возможность регулярной интимной близости. Нехватка времени, неудачный опыт, отсутствие желания искать себе женщину… Но организм требует разрядки, и как альтернатива сексу приходит мастурбация.

О мастурбации не принято говорить открыто в обществе и обсуждать этот вопрос с друзьями или коллегами. Более того, сам человек зачастую испытывает негативные мысли по поводу самоудовлетворения. Это связано с религиозными, общественными веяниями, собственными моральными убеждениями. Тем не менее, медицинские исследования и анонимные анкетирования говорят о том, что мастурбация присутствует в жизни мужчин и женщин разных возрастов, как одиноких, так и имеющих постоянного партнера.

провоцируют значительное увеличение тестостерона. Все гормональные колебания во время сексуального удовлетворения кратковременны и заключаются в гормональных всплесках.

Советы по отказу от навязчивого желания мастурбировать
Воздерживаться от мастурбации, накапливая эмоциональное напряжение и подавляя собственное либидо, или нет, решать, конечно, мужчине. Но если этот процесс отнимает все больше и больше свободного времени, замещает собой обычные отношения с женщиной, становится причиной угрызения совести и конфликтов в паре, стоит прибегнуть к некоторым советам:

Завести отношения. Познакомиться с женщиной, общение с которой плавно перейдет в сексуальное русло.
Разнообразить отношения с женой, если они утратили былой огонек и не приносят достаточного удовольствия. Пригласить супругу на свидание, провести вечер без детей, поиграть в ролевую игру.
Освоить новый вид спорта, обзавестись хобби, другими словами — переключить свое внимание и занять свободное время.
Больше находиться в обществе, оставляя минимальное время на уединение.
Отказаться от частого просмотра фильмов для взрослых и прочтения рассказов эротического содержания.
Обратиться к специалисту, если отказаться от частой мастурбации самостоятельно оказывается сложно.

В числе неоспоримых позитивных влияний от процесса мастурбации и последующего оргазма выделяются:

Снятие сексуального и эмоционального напряжения, получение удовольствия.
Профилактика застойных явлений в предстательной железе, половом члене и яичках. Прилив крови в органы малого таза, наполнение кровью пещеристых тел пениса во время эрекции, сокращение мышц тазового дна во время эякуляции улучшают обменные процессы в тканях и препятствуют застою.
Знакомство с собственным телом, изучение эрогенных зон. Расширение знаний о собственных телесных сигналах, связанных с возбуждением.
Сексуальное самоудовлетворение без риска заражения инфекциями, передаваемыми половым путем, и возникновения нежелательной беременности партнерши. Своего рода воздержание от половых отношений с женщинами и их замещение — явление нечастое, но встречающееся.\n''', Colors.red_to_yellow, interval=0.001)

def base_sex():
	pystyle.Write.Print('''Как правильно заниматся сексом?
В сексе нет правил, но есть пожелания, основанные на здравом смысле и научных исследованиях. Возможно, какие‑то из наших рекомендаций покажутся очевидными. Однако, как показывает опыт, иногда полезно напоминать себе о самых простых вещах.

Не относитесь к сексу слишком серьёзно
Безусловно, секс — важная часть нашей жизни. Он укрепляет здоровье, улучшает сон, поднимает настроение. Но если вы подходите к интиму слишком серьёзно — ставите себе нормативы, прорабатываете сценарий, от которого нельзя отклоняться, то из постели уходит элемент игры. Вы становитесь слишком требовательны к себе и партнёру. И в результате вместо удовольствия и пользы получаете неудовлетворённость и фрустрацию.

Не нужно быть перфекционистом в сексе. Отключите голову и воспринимайте его как игру, единственная цель которой — приносить и получать удовольствие.

Каждый раз получайте согласие
Причём согласие должно быть активным. Это означает, что взрослый человек находится в сознании, не под действием алкоголя или наркотиков и добровольно выражает словами, что он хочет секса. Согласие даётся на каждый вид взаимодействия, а не на всё разом, и его можно отозвать в любой момент. Если партнёр передумал, нужно сразу остановиться.

Отключайте смартфоны
Вы берёте включённый смартфон в спальню? Вероятность того, что вы проведёте час перед сном с девайсом в руках, в два раза выше шансов на романтическое общение с лежащим рядом партнёром. Таковы результаты исследования, проведённого среди американцев.
25% опрошенных признались, что экран смартфона (вовсе не лицо любимого) — последнее, что они видят перед сном;
55% понимают, что слишком плотное общение с гаджетом снижает качество их интимной жизни;
35% отмечают, что секс здорово пострадал из‑за смартфона.
Вывод? Если нет возможности (или силы воли) отключить мобильный до утра, то хотя бы поставьте его в режим «Не беспокоить».

Уделяйте время прелюдии
Насколько будет хорош секс, во многом зависит от прелюдии. Причём для мужчин предварительные ласки почти так же важны, как и для женщин. Согласно исследованиям, любовникам обоих полов нужно 18–19 минут, чтобы качественно разогреться. Но из‑за нехватки времени или нетерпения одного из партнёров прелюдия в среднем длится 11–13 минут.

Разговаривайте о сексе
Многих смущают разговоры на интимные темы. Поделиться желаниями сложно даже с человеком, с которым вы не первый год спите в одной постели. И всё-таки единственный способ получить тот секс, о котором вы мечтаете, — это разговаривать о нём.

Смотрите друг другу в глаза
Хотя бы время от времени. Зрительный контакт усиливает возбуждение и помогает установить более глубокую эмоциональную связь. Если вам пока неловко подолгу смотреть друг другу в глаза во время секса, обменивайтесь короткими взглядами, задерживая их хотя бы на пару секунд. А со временем развивайте эту способность — чтобы почувствовать настоящую близость.

Экспериментируйте
В стабильных парах секс довольно быстро теряет остроту. Уже через год спокойных семейных отношений интерес к интимной жизни снижается у 34% женщин и 15% мужчин. Больше удовольствия в постели получают партнёры, которые умеют озвучивать свои потребности. И не только не боятся, но и стремятся экспериментировать. Чтобы изгнать рутину из спальни, попробуйте:

• секс‑игрушки;
• новые позы;
• тантрический секс;
• секс в необычных местах;
• ролевые игры.

Не допускайте боли и дискомфорта
Если какая‑то поза причиняет вам боль, сразу сообщайте об этом. Секс — это о взаимном удовольствии, а не о молчаливом самопожертвовании. То же касается и неприемлемых для вас эротических практик. Партнёр или партнёрша фантазирует о БДСМ или сексе втроём, а для вас это табу? Внимательно выслушайте, не осуждайте, но и не соглашайтесь, ломая себя. Просто объясните, почему нет.

Изучайте матчасть
До сих пор взрослые люди с активной половой жизнью спотыкаются на, казалось бы, простых вопросах:

сколько всё-таки видов оргазмов у женщин;
нужно ли предохраняться во время орального секса;
можно ли забеременеть во время месячных.
В идеале каждый должен был узнать это от родителей в формате доверительной беседы и на уроках полового просвещения в школе. Если с вами этого не произошло, есть статьи Лайфхакера.

Познакомьтесь со своим телом
Если вы не знаете, что любите, то добиться нужных действий от партнёра будет сложно. В узнавании себя поможет мастурбация. Не торопитесь быстро кончить под порноролик, а как исследователь медленно и вдумчиво изучайте каждый сантиметр своего тела: где прикосновения откликаются, а где вызывают дискомфорт, в каких местах нужно действовать посильнее, а где подойдёт только нежность. Только после знакомства с собой вы сможете научить партнёра обращаться с вами.

Уделяйте внимание всем частям тела
А не только пенису у мужчин, клитору и груди у женщин. Исследуйте другие очевидные и неочевидные эрогенные зоны. Например, время от времени делайте массаж яичек. Это не только приятно, но ещё и крайне полезно для сексуального удовлетворения обоих партнёров.

Стремитесь к оргазму, но не зацикливайтесь на нём
Французы называют оргазм la petite mort, или «маленькая смерть». Половой акт без кульминации может показаться неудачным или неполноценным. Девушки имитируют оргазм, чтобы не расстраивать партнёра. Мужчины комплексуют, если у них не получилось эякулировать или доставить неземное наслаждение партнёрше. А от стресса рукой подать до стабильно низкого либидо.

Не стоит зацикливаться на результате, лучше наслаждаться процессом. Не так уж важно, закончится ли всё бурным одновременным оргазмом или сегодня вы просто уснёте друг у друга в объятиях, ни разу не «умерев». И то и другое абсолютно нормально.\n''', Colors.red_to_yellow, interval=0.001)

def nasil():
	pystyle.Write.Print('''Блчть это пиздец. Для начала нужно найти самого папика - вообще он может быть любой, но чем старше тем шансы больше.
1.Пытайтесь уделять ему внимание
2.Обнажайте себя
3.Часто говорите про что-то
4.Попадайте в неловкие ситуации
5.Делайте что-то сексуально (блять пиздец что я пишу)
6.Пытайтесь делать что-то то что похоже на мнет/спрму

Поздравляю! Скорее всего вас уже изнасиловали, а меня увезли в дурку!\n''', Colors.red_to_yellow, interval=0.001)

def minet():
	pystyle.Write.Print('''
1. Вступление

У всех разное понимание ощущения и фантазии, шаг №1, научиться говорить друг с другом, для начала просто "приятно" "не приятно" "больно". Дальше когда все раскрепостятся, уже можно более подробно. Увы это важно, в обе стороны. Если один начинает диалог, то второй его как правило продолжает. Начинайте с малого, прощупывайте почву, возможно ваш идеальный минет, это самый простой и быстрый, а может вам потребуются все доступные техники. В ходе практики вы придете к вашему идеальному формату. Также стоит попросить мужчину удалить лишние волосы с половых органов, намекнув на минет, помыть, используя приятный для девушки гель для душа. Девушка может просто заменить его бутылочку на нужную вам. Скорее всего он даже не заметит подмены. Если спросит - скажите - "Мне так нравится этот запах, думаю на тебе он будет особенно хорош". Пред вами предстанет выбритый, чистый, приятный на запах и вкус член, который не жалко будет лишний раз вкусить, ну и визуально он для всех будет выглядеть больше.

2. Подготовка.

а) Макияж.

Найдите свой сексуальный образ. В основном важно, чтобы вы себе самой нравились. Из общих рекомендаций: Желательно использовать не маркую помаду, или как там у вас называется. Подсказка - вечерний макияж, ярко-красная помада, тени. Но не переборщите, как первоклассница, которая сперла мамину косметичку. Волосы на голове сразу в хвост (хвост как правило лучше чем косички). Также из раза в раз меняем образы от одного к другому, используем разный макияж, белье, одежду.

б) Белье.

Кружевное белье, черное, красное, белое - лучшие варианты. Чулки, ну и весь этот набор. Тогда вас можно будет потихоньку раздевать, и останется загадка, которую нужно будет раскрывать потихоньку.



в) Позы.

Найдите удобные позы, позаботьтесь о своих коленках для стоячей позиции, и спине для лежачей. Подберите подушку, или сложите полотенце под колени. И найдите удобную позу, в которой вы будете меньше всего уставать. Шея будет уставать, если угол будет неудобный. Но не сбивайтесь в комочек. Сосущий комочек это не очень. Раскрепощенная, удобная поза, на коленях, между ног у парня - на практике наиболее комфортна. Помните, что у вас должен быть доступ и члену и к яйцам, ртом, лицом, и обоим рукам (руки придется менять, т.к. на одну вы будете опираться).

г) Волосы на теле.

В подавляющем большинстве случаев нам нравится гладкая кожа, и отсутствие растительности, кроме (!!) волос на голове. Если вы обладательница густой растительности, сочувствую вам, но если вы хотите результата, то уберите пушок под носом. Темные волосы на руках - расхож с женственным образом, так что их под бритву (не по венам, - просто бреем). На ногах, вагине, и (!!!) жопе (и булки, и анус) обязательно убираем, только если ваш партнер не приверженец старой школы. Об этом можно легонько намекнуть, или спросить. Сам он постесняется сказать в 99%. Лучше всего прямо.

д) Зубы.

Возьмите банан, очистите его от кожуры, и пробуйте техники. Очень важно (!!) не касаться головки члена зубами. Иначе на ближайшую неделю останетесь без секса, - член будет болеть, даже если встанет, это будут мучения для него, и надолго его не хватит. А вы же хотите, чтобы он свой член на вас использовал, верно? Думаем о себе заранее. При тренировки, банан должен остаться в целости. Если погрызли, - значит тренируемся еще. Но не боимся сосать, даже если погрызли. Мужчина будет счастлив, даже если вы его покусаете. Спросите его после минета - я тебя не покусала? Чаще всего царапаются жевательные зубы, контролируем вход строго параллельно зубам.

ж) Вспомогательные инструменты.

Возьмите вкусный съедобный лубрикант, может несколько разных вкусов, и лейте на член, сколько потребуется. Так член может быть со вкусом клубники, малины, вишни, кофе. Устройте себе вкусовой оргазм. Для себя возьмите вибратор, чтобы было веселее.

з) Договоритесь о нюансах.

Если вы не готовы к окончанию в рот, скажите ему заранее куда кончить. Конечно практически любой мужчина жаждет, чтобы его сперму проглотили, он жаждет залить ваше лицо спермой.

и) Не целуйтесь.

Поверьте, как бы мы ни любили наш член, пробовать его на вкус это последнее что мы хотим. Не обижайтесь на него, он не вас противится, он противится вкуса своего члена. Вас он будет боготворить за ваш минет. Но целоваться при минете, может оказаться непредсказуемым. Чтобы точно узнать противно парню или нет, можете выпятить губы, и поднести свое лицо к его лицу. Если он вас сам поцелует, то ок - целуйтесь. Если же не шелохнется, чмокнет в губы, или отпрянет, - то он не хочет этого вкуса. Даже если этого вкуса уже и нет. Не переживайте, он не перестанет вас целовать, как только вы сполоснете рот после минета, он вас зацелует. Поэтому если хотим поцелуев, то делаем их до минета. Либо используем мощь поцелуев в сексы без минетов (не каждый секс обязан быть с минетом).

2. Эстетика.

Помните, что крайне важно как это выглядит. Попробуйте перед зеркалом или на камеру, поймайте наиболее выгодные ракурсы. Вы тут актриса, и это ваш спектакль, забудьте, что на жопе прыщ, или сегодня синяки из-за недосыпа. Об этом вспомните после секса. Вы не заметите - он не заметит. Годный перечень приемов, комбинируя которые можно получить фееричный результат:

а) Смотреть глаза-в-глаза. Важно не щуриться, и не выпучивать глаза, посмотрите, как ваш взгляд наиболее сексуально выразителен перед зеркалом, чтобы не напугать беднягу.

б) Иногда улыбаться, попробовать наслаждаться процессом, или по крайней мере делать вид, что вы счастливы сосать его член. Это важно, мужчина любит свой член, и хочет чтобы его любили. Любят его член - любят его.

в) Дразнить близостью лица к члену, но не сосать, - чем больше нас дразнят, тем больше мы хотим, и больше возбуждаемся. Касаться щеками, Но не заигрываться в это, а то заскучает бедняга, или перевозбудится (тут мы похожи с девушками).

г) Язык тела. Изгибайтесь, меняйте позицию

д) Стонать. Не слишком громко, но и не как мышь. Поласкайте наедине с собой киску, и на видео запишите свой стон, чтобы вам нравился. Не нужно орать, выть, визжать, скулить. Легонько постанываем. Гласная "А" и согласная "м" лучше всего подходит, не напрягая голосовые связки, нежное "аа", "мм". Но не увлекайтесь, не нужно наигрывать. Если не получается сразу, - забейте, к этому можно вернуться позже, но минет в молчании обоих партнеров, выглядит как немое кино, звук изобрели, так что им нужно пользоваться.

е) Прислонять член к лицу, виться как кошечка, об ногу, только об член. Придвиньтесь к члену, и положите его себе на лицо, касаясь щеками, тритесь, вверх, вниз. Невероятный эффект сопоставления члена и лица. Мы хотим думать что у нас самый большой член, и это прием максимально дает это раскрыть. (Если у вас голова как арбуз, а его член как пипетка, то избегайте этого).

ж) Ласкать себя, сдавливать грудь, ласкать свою киску, гладить себя. И вообще создавайте себе качественную ассоциацию, - сосу, значит мне хорошо, я возбуждаюсь. Ну и чтобы самой не заскучать. Также это поможет быть готовой к моменту вагинального проникновения. Если киска будет сухая, мужчина загрустит, что вы вынужденно сосете, а вы должны быть счастливы сосать!!!

з) Не переигрывайте, начните с малого, раскрепощайтесь, в конце концов выработаете свой стиль. Для начала он будет рад и самому скупому всовыванию-высовыванию.

и) Говорите, спрашивайте, интересуйтесь. И следите за реакцией. У каждого она своя. Если парень выпятил член выше и вперед к вам - верный признак что он очень возбужден, и вы на правильном пути. Стоны, вздохи потихоньку запоминаем, изучаем.

3. Техника ласк.

а) Легкие ласки.

Не насаживайтесь лицом на член как заправская порно актриса. Начните с малого, - оближите его. Расслабьте язык, сделайте его максимально широким, и облизываем. Не торопясь. По головке, влево вправо, вверх, вниз, по кругу. Спускаемся ниже языком по стволу. Не боимся капать слюнями, больше слюней - лучше. Поработали языком по члену - можно перейти к яйцам и простате (далеко не суйтесь, работаем сразу под яйцами и в первые разы простату лучше вообще не трогаем, еще подумает, что в жопу ему лезете - напряжется, а вам это незачем). Яйца можно лизать прямо между двух яиц, но без давления, нежным языком, влево-вправо, вверх-вниз. Помним чувствительные зоны - уздечка, головка, яйца, основание члена, где соединяются с яйцами. Но только на них не концентрируемся, даем расслабиться. Стараемся не отрывать рта и языка от члена. Также используем губы - обхватываем губами член, яйца, гладим губами. Меняем то язык то губы по всей площади. Помним что слюней в этом деле мало не бывает.

б) Работа руками.

Трогать, трогать, и еще раз трогать. Анус - запретная часть, ее не трогать, если не просит. Член, яйца и простата (между дыркой в жопе, и яйцами) наше все. Будьте нежны, не хватайтесь сразу как за поручень, ласкайте, обхватывайте, массируйте. Головку насухую без смазки (слюни/спец. смазка) руками не трогать! Яйцы тоже ласкаем. Снизу, обхватываем их, нежно дрочим вверх-вниз от головки члена, до яиц. Со временем увеличиваем жесткость амплитуды. Сжимайте сильно член у основания, перекройте ему выход крови, - так член разбухнет, и увеличится чувствительность. Обхватите яйца рукой и оттяните вниз, тем самым член станет чуть больше, и направится строго вам в рот. Сожмите яйца, сначала не сильно, потом сильнее, найдите порог боли сжатия яиц, вот эта грань вам и нужна, чтобы было самую малость больно.

4. Техники самого сосания.

По сути сосание может быть:

а) легкое посасывание головки члена. Можно сравнить с сосанием чупачупса, у нас есть головка члена и уздечка, мы концетрируемся на них, и сосем как будто это самый вкусный чупачупс в вашей жизни. Когда член внутри языком нежно водим по кругу, на головке, по уздечке языком вверх вниз.

б) вакуумное сосание. Когда член внутри, выкачиваем воздух из рта, и создаем вакуум во рту, прижимаемся всей площадью языка и неба к члену и водим вверх-вниз. От вакуума, член должно быть сложно вытащить из рта.

в) глубокий минет, в глотку, или на полную длину. Тут нужно тренироваться, пожалуй лучше с огурцом. Для начала научитесь отменять рвотный рефлекс, положите 2 пальца на корень языка, и продвигайтесь внутрь глотки, подержите так несколько секунд. Повторяйте пока не научитесь контролировать рвотный рефлекс. Огурец подберите соответствующего члену размера. И научитесь всовывать в себя без последствий. Будет ужасно для всех, если вы заблюете его промежность и постель.

г) Сосание с активным языком. Язык - самый главный инструмент в этом деле. Когда член внутри - высовываем язык, и ласкаем его снаружи рта. Когда член внутри не забываем делать движения языком. Высуньте язык за секунду до взятия в рот, чтобы член плавно по языку входил вам в рот. Прижимайте языком член к нёбу. Если насадились на всю длину - пробуйте еще лизать яйца.

Заключительные рекомендации.

---------------------------------------------------------

Не зацикливаемся на чем-то одном. Постоянно меняем техники между собой в процессе. Чем разнообразнее будет ваша программа, тем фееричнее будет эффект. Поэтому поласкали, полизали, пососали, подолбились в глотку, снова полизали, поласкали, вытащили, поиграли, отдохнули, потерлись и т.д. Не забывайте про руки, помогаем направлять член в нужную сторону. Пробуйте сосать вовсе без рук. Меняйте позы тела, изгибайтесь, извивайтесь. Это ваш танец, ваше выступление. Будьте ритмичны. Замедляйтесь, ускоряйтесь, сбивайте ритм. Останавливайтесь. Накидывайтесь со зверским аппетитом. Отстраняйтесь, полежите. Не забывайте про себя, трогайте себя, возбуждайте себя. Особенно круто, это поочереди - сосать, трахаться, снова сосать. Положите огромную пачку влажных салфеток рядом, чтобы протирать его достоинство, а лучше передайте эту обязанность ему. И отмечу, что от хорошего минета, член увеличивается. За 3-5 лет активных минетных отношений член может вырасти на несколько сантиметров в длину, и в ширину. Что незамедлительно скажется на ваших ощущениях.

P.S.Эксперименты.

Фантазируйте. Пробуйте, не стесняйтесь сделать неправильно, делайте все, что придет в голову. Если что-то пойдет не так, он вас остановит, или скажет об этом. Чувственность, открытость и сексуальность партнеров раскрываются в отношениях на практике. Говорите о сексе. Говорите во время секса. Хвалите партнера. Не ругайте партнера. Делитесь чувствами. Делайте комплименты ему и его члену. Говорите что вам сложно уместить его член в себя. Говорите что у него большой. Не стесняйтесь глупостей. Во время секса можно и нужно и смеяться. Не бойтесь неловких ситуаций. И вы откроете новые горизонты отношений. А ваш мужчина предстанет перед вами с другой стороны, и в последствии откроется вам. Не делайте того, что вам не хочется, говорите о том, что не хочется.\n''', Colors.red_to_yellow, interval=0.001)

def kuni():
	pystyle.Write.Print('''
Куннилингус незаслуженно считается одним из самых сложных сексуальных действий. Видимо, этот стереотип вытекает из другого — о «сложности» и «загадочности» женских гениталий. Представленные ниже советы помогут освоить этот навык и получить репутацию лучшего любовника в жизни женщины.

1. Овладейте теорией
Большинство женщин получают оргазм от стимуляции клитора, поэтому всё ваше внимание должно быть сосредоточено вокруг него и на нём самом. Только в кино девушке обязательно проникновение после него, чтобы секс был настоящим. А в жизни это самый краткий путь к женскому оргазму. Поэтому не относитесь к куннилингусу только как к аперитиву.

2. Убедитесь, что вы оба этого хотите
Сексолог Ванесса Марин утверждает, что многие женщины испытывают дискомфорт во время куннилингуса. Одна из причин — нереалистичные представления и мужчин, и женщин о виде, запахе и вкусе женских гениталий.

Вагина не розарий. Она не может выглядеть и пахнуть как роза.

Если вы из тех, кто сравнивает женские гениталии с рыбой или чем‑то подобным, пожалуйста, не делайте куннилингус. На самом деле вы этого не хотите. Если же вы готовы к оральным ласкам, но ваша партнёрша стесняется, не давите на неё, а постарайтесь поговорить.

3. Позвольте партнёрше расслабиться
Многие женщины испытывают дискомфорт во время куннилингуса. Для одних он связан с комплексами по поводу собственного запаха и вкуса или внешнего вида своих гениталий. Другие волнуются, что мужчине не нравится этим заниматься. Третьи не любят быть в центре внимания и не могут расслабиться. Как правило, женщина гиперкритично относится к своему телу, поэтому ваши глаза, нос и рот в самой чувствительной и уязвимой её зоне вызывают как минимум лёгкое сопротивление.

Конечно, вы не сможете разом изменить самоощущение партнёрши. Но вы можете помочь ей расслабиться. Во многом успех будет зависеть от вашего восприятия орального секса. Поэтому дайте девушке понять, что относитесь к процессу серьёзно, что для вас это не прелюдия перед «основной частью» и что вас это реально заводит.

4. Не забудьте о защите
Куннилингус может подарить не только улучшение отношений, но и заболевания, передающиеся половым путём: гонорею, герпес, сифилис, вирус папилломы человека и другие.

Если нет справок от венеролога, то для орального секса тоже нужны барьерные контрацептивы.

5. Подготовьте партнёршу и себя к долгому наслаждению
Прелюдия перед куннилингусом — ещё один способ расслабить и возбудить девушку. Плюс это просто необходимо: клитор слишком чувствителен, брать его нахрапом — не лучшее решение. Ванесса Марин советует потратить время на поцелуи, объятия, прикосновения, рассказ о своих фантазиях. И только когда женщина достаточно возбудится, переходить к гениталиям. Но и там торопиться не стоит: начните с лёгких движений языком вверх‑вниз.

Учтите: даже после такой подготовки партнёрша достигнет оргазма в среднем через 20 минут. Поэтому позаботьтесь о своём комфорте.

Убедитесь, что ваше тело находится в удобном вытянутом положении. Постарайтесь расположить губы и язык под углом 45 градусов, а не 90 — так вам будет легче. Для этого упритесь дёснами в тело партнёрши, а головой — в её ногу. Чтобы это стало возможным, её ноги должны находиться достаточно близко друг к другу.

Если вам не нравится делать куннилингус лёжа, можете встать на колени у кровати. Но, какой бы способ вы ни выбрали, удостоверьтесь, что вам удобно и вы готовы выполнять все действия без спешки.

6. Освойте базовую технику куннилингуса
По словам сексолога Ванессы Марин, есть ещё одно очень важное правило: во время куннилингуса лучше быть нежным и методичным, а не грубым и непредсказуемым. Это значит, что вам нужно найти способ, который нравится вашей партнёрше, и следовать ему.

Придерживайтесь базовой техники:

После подготовки сосредоточьтесь на облизывании области передней спайки (место прямо над головкой клитора, где соединяются половые губы). Время от времени ласкайте сам клитор языком и указательным пальцем.
С ростом возбуждения проникайте во влагалище — сначала языком, затем одним‑двумя пальцами. Но не совершайте возвратно‑поступательных движений. Лучше прижмите пальцы к передней стенке влагалища там, где находится наиболее чувствительная область, и продолжайте стимулировать клитор языком.
Свободной рукой ласкайте грудь, живот и другие эрогенные зоны партнёрши.
Этот метод можно использовать как отправную точку. Однако не забывайте, что у каждой женщины есть свои предпочтения. Одним нравится одновременная оральная и ручная стимуляция, другим — нет. Одни быстрее достигают оргазма, когда клитор облизывают сверху вниз и снизу вверх, другие — когда по кругу, третьи — когда выводят какие‑то символы, четвёртые — когда посасывают.

Наблюдайте за девушкой, чтобы понять, что приносит ей больше удовольствия. А ещё лучше — спросите напрямую: она наверняка в курсе.

7. Не переусердствуйте с техникой
Есть какие‑то общие моменты, например:

язык лучше не высовывать, чтобы он не был слишком твёрдым и не пересыхал;
концентрироваться можно не только на клиторе, но и на пространстве вокруг него;
начинать сразу с интенсивного воздействия на клитор не стоит.
Но в остальном идеального способа для всех не существует.

В интернете много советов про супердвижения, которые «снесут девушке крышу». Например, некоторые предлагают схемы сварочных швов. Так вот: они так не работают.

Как только вы сосредотачиваетесь на каких‑то определённых движениях, вы перестаёте следить за реакциями партнёрши и теряете с ней контакт (а это вообще главное). К тому же нет ничего хуже, если вы тормозите, потому что вспоминаете, что делать сейчас, или сбиваетесь и начинаете очередной секретный манёвр заново. Всё это легко считывается принимающей стороной и вызывает неловкость и раздражение.

Лучшее, что можно сделать — отдаться процессу и самому получать удовольствие.

8. Усильте ощущения с помощью интимной косметики
Некоторые виды смазки для орального секса усиливают ощущения: разогревают, охлаждают или повышают чувствительность. Есть даже специальные жидкие вибраторы, которые ускорят наступление оргазма.

А вот экспериментировать с продуктами не стоит — обострение молочницы после секса явно не добавит очков вашей репутации лучшего любовника.

9. И ещё раз: уделите внимание передней спайке
Это рекомендует автор книги по удовлетворению женщины Ийен Кёрнер. По его словам, передняя спайка половых губ — зона, которая часто игнорируется в куннилингусе из‑за её преступной близости ко всем известному клитору. Кёрнер же утверждает, что давление на эту область стимулирует тело внутреннего клитора (да‑да, головка — это только вершина айсберга).

Он предлагает использовать следующий метод: прижмите верхнюю губу или десну к месту над клиторальным капюшоном и облизывайте область вокруг клитора. Если ваш рот находится под углом 45 градусов к телу женщины, изобразите улыбку Элвиса Пресли — такое положение губ облегчит процесс.

10. Подготовьтесь к оргазму
Когда партнёрша приближается к финалу, Ванесса Марин советует плотнее сомкнуть ноги девушки, чтобы усилить стимуляцию.

Самая важная вещь, которую вам стоит усвоить: не меняйте ритм и сам способ стимуляции (если только партнёрша не просит об ином).

Для большинства женщин стабильные ласки являются главным ключом к оргазму. Поэтому, обнаружив тот самый способ, не изменяйте ему. В противном случае рискуете остаться в спальне с расстроенной девушкой.

И последний совет: помните, что клитор очень чувствителен после оргазма. Дайте партнёрше отдохнуть после куннилингуса, прежде чем переходить к новым активностям. И конечно, не забудьте сказать ей, как вам всё понравилось, и поздравить себя с отлично выполненной работой!

Эксперт в области женского удовольствия Ийен Кёрнер приводит в своей книге три постулата, которые нужно усвоить мужчине, чтобы вместе с партнёршей наслаждаться процессом.

Во время куннилингуса вы забываете о себе — теперь ваше удовольствие зависит от её удовольствия.
Вы не торопитесь: она заслуживает всего времени в мире. И вы хотите наслаждаться каждым моментом.
Её запах возбуждающий, её вкус потрясающий. И оба они — часть прекрасного естества\n''', Colors.red_to_yellow, interval=0.001)

def pervi_sex():
	pystyle.Write.Print('''
Гайд по первым отношениям и первому сексу для фореверэлоунов и обычных парней.⁠⁠

Приветствую тебя, брат! Идея написать данный гайд, посетила меня совершенно случайно пару дней назад, во время обычного чтения комментов в горячем, в связи с огромным засильем в них людей с такими же проблемами которые есть у меня (да да, именно "есть", а не "были", объясню позже) и самонадеянно решив, что могу дать несколько советов, я принялся за его написание. Пост получится довольно длинный, но не спеши кричать тлдр, постарайся все же "асилить", обещаю, это будут не самые бездарно потраченные тобой 15 минут.

Перед тем, как я начну, хочу сделать несколько ремарок: во-первых, я не являюсь пикап мастером, секс гуру, тренером личностного роста, психологом или еще каким мудреным специалистом, я такой же как и ты, фореверэлоун, с теми же самыми проблемами и бедами, во-вторых, я не буду навязывать свое мнение, а лишь дам несколько общеупотребимых советов по этим двум темам, в-третьих, ты, мой друг, можешь вполне законно посчитать меня очередным сраным теоретиком, пытающимся впарить лажу или учить тебя жить, но нет, все мои выводы и советы, основаны на собственном скромном опыте.

Ну что, поехали?

Итак, часть первая "Отношения".
Я сознательно опущу, казалось бы, самый важный этап: знакомство. Тому есть несколько причин: люди все разные и все варианты встреч и знакомств смог бы предугадать разве что Гэри Сэлдон. Встретитесь ли вы в кафе, за барной стойкой, удерживая мид в дотке, в онлайн игре, на улице, в школе, университете - не важно, рано или поздно, но ты понравишься девушке, а она понравится тебе. Да, будет именно так. Чтобы это произошло раньше, а не позже, существуют до боли тупые советы: старайся следить за собой, внешним видом, занимайся чем-то, имей хобби. Бывает, девушки пишут первые, это не фантастика, Карл!

Между тем, не все осознают, что мы, фореверэлоуны - одни из самых прихотливых в выборе девушек люди. Как бы смешно и странно это не звучало. Это действительно так, мы никогда не купимся на красивую безмозглую куклу, которая даже мид подержать не сможет (шутка), с которой не о чем поговорить, которая не сможет понять что-либо сложнее интерфейса инстаграма. Мы куда охотнее выберем серую мышку, с головой на плечах, собственным мнением, количеством прочитанных книг > 1, и так далее, думаю, ты понимаешь о чем я. Наша идеализация и обожествление или показушная ненависть и презрение женского пола - два стороны одной медали, медаль эта называется - непонимание. Во все времена люди либо обожествляли, либо невидили то, чего не понимали. Приверженцы светлой стороны - это люди, более всего отвечающие понятию "джентльмен", в нашем современном мире. Гордитесь этим! Ведь именно мы, те, кто будет с обходиться со своей девушкой максимально корректно, нежно и ласково. Что же насчет приверженцев темной стороны? Они моментально перейдут на светлую сторону, когда их симпатии, внезапно окажутся взаимными.
Итак, я немного отвлекся. Вы познакомились, понравились друг другу и решили продолжить общение. Вступили в отношения. Что же дальше?

Совет первый: проявляй инициативу. Пиши ей первый, звони ей первый, зови гулять первый. После первой притерки друг к другу, можно начинать экспериментировать: "пропасть" на денек и не писать, дождаться пока напишет первая, но только после первых двух-трех недель исключительно ТВОЕЙ активности. И никак иначе. Забьешь сразу - расстроишь и огорчишь ее. Ты мужик, помни об этом.

Совет второй: тебе понадобится некоторое количество денег (спасибо, кэп!). Кино, фастфуды, шоколадки, мороженное, боулинг, картинг - все это потребует от тебя наличия деньжат на кармане, не много. Плати за обоих. Не будь скупердяем, это нормально. В теории, можно обойтись и без денег, но это если ты играешь на хардкоре и у тебя хорошо подвешен язык, чтобы постоянно болтать с ней о чем-то во время прогулок. Но я бы не рекомендовал поступать так. Развлекай ее.

Совет третий: не будь скучным. Как? Это очень просто. Перед очередным свиданием просто почитай какую-то интересную статью в интернете, с любого новостного портала и расскажи ее при встрече своей девушке. Выбирай нейтральные темы. Чуть позже можно будет начать с ней спорить на различные темы, но не спеши с этим. Пример: вы идете на фильм, почитай рецензии на него, почитай о чем фильм, разузнай побольше о фильме. Информация - это власть. Теперь ты можешь "умничать" во время фильма, ведь ты знаешь о нем чуть больше, чем она. Девушки любят умных. Не переусердствуй с "умничанием".

Совет четвертый: следи за тем что говоришь. Следи за своим языком, ху*ло! (в этом моменте я ругаюсь сам на себя) Это, считай что, самый важный момент. На первых порах, любым случайно сказанным словом в ее адрес, ты легко можешь ее обидеть, разозлить и в итоге потерять. Даже не думай ей намекнуть, что она какая-то не такая, чем-то отличается от других, что ты ее в чем-то превосходишь. Не вздумай ее троллировать чем либо. Потом будет можно, сейчас - табу.

Совет пятый: не бойся касаться ее. Лапать не стоит, но брать за руку, обнимать за талию, гладить - это то что нужно. Можешь даже не сомневаться что ей понравится. Просто будь галантным, осторожным, но настойчивым в этом. Этим самым ты развяжешь и ей руки, она начнет с охотой трогать и тебя. И уж поверь, тебе это тоже очень понравится.

Совет шестой: интересуйся ей. Расспрашивай про ее жизнь, не лезь глубоко в прошлое, но о школе-универе, вполне можно разузнать. Интересуйся о том, как она проводит свой день, чем занимается, что читает, что смотрит. Но, чувствуй границу навязчивости. Не переступай ее.

Совет седьмой: целуй. Казалось бы, что может быть сложнее? Но это настолько просто, что даже смешно. Через какое-то время общения тебе захочется этого. Лучше в уединенном месте в первый раз. Не на улице. Идеально дома. Не можешь уловить момент и понять хочет ли она этого? Боишься что она неправильно поймет? Нормальные страхи. А язык тебе зачем? Прямо и скажи ей об этом: "Хочу тебя поцеловать!". И все! 99% если до этого все было нормально, ты получишь утвердительный кивок или ответ, не важно. Ну и все, вперед. Первый раз будет топорно, неуклюже. А следующий поцелуй, который случится ровно через пять секунд после первого - уже будет лучше, через минуту ты уже всему научишься и все поймешь и посмеешься, насколько это было просто. И приятно. Спрячь стояк, если обстановка к этому еще не располагает. После этого - целуй ее при любом удобном случае.

Совет восьмой: действуй по обстановке. Ощущаешь, что можно зайти чуть дальше - попробуй. Только желательно спроси ее об этом. Это не глупо, это разумно. Хочешь провести какой-то эксперимент, например, погладить ее по голой спине или залезть под одежду? Делай это постепенно, в случае отказа - не упрямствуй и не огорчайся. Все будет, только чуть позже.

Совет девятый: извиняйся. Сотворил\сказал хуйню? Извинись, многим из нас бывает просто нереально сложно признать свою собственную неправоту, ведь мы же практически всегда правы! Так мы считаем. Но тебе придется переступать через себя и извиняться первым. Да да, Карл, тебе придется извиняться даже тогда, когда ты действительно прав, а неправа она. Брать вину на себя.

Совет десятый: дари цветы. Почему отдельным советом идет, казалось бы, такая банальщина? Ты даже не представляешь, какое положительное влияние цветы оказывают на девушек! За красивый букет и слова сказанные в процессе вручения букета, она простит тебе сразу кучу не очень серьезных (а может и серьезных) твоих косяков. Сотворил\сказал серьезную хуйню? Загляни к ней домой, принеси букет цветов и извинись. Это сработает! (инфа 148%)

Самый главный совет: думай головой, понимай, что это не твой дружбан по контре или дотке, мамку которого ты провожал в кино в комментариях. Измени стиль своего общения. Это совсем другое создание. Будь с ней обходительным и она тебя отблагодарит своей нежностью и любовью. Будь человеком, а не мудаком.

На этом я пожалуй буду закругляться с первой частью своего гайда. Если что-то еще вспомню про отношения, допишу в начале второй части.

Если пикабу понравится то, как я пишу и то, о чем я пишу - вторая часть гайда будет про первый секс, про то как бороться с двумя самыми большими страхами перед ним, о предохранении, о том что стоит делать, а чего не стоит, и прочие вещи. Писать постараюсь максимально подробно и конечно же, без всяких глупых стереотипов. Никакой воды, только практические советы и рекомендации из личного скромного опыта.\n''', Colors.red_to_yellow, interval=0.001)

def his_sex():
	pystyle.Write.Print('''Пару месяцев назад добирался из Москвы на юг. Жара стояла плюс 40,в автобусе и того больше. Я одел джоггеры, а трусы снял. Так как не люблю когда натирает и давит.

Выехали поздно, и я быстро отрубился. А у меня есть особенность, что во сне может встать. Когда бус остановился на заправке, я пошел в туалет, и тогда уже заметил как весь автобус уставился на мою приличных размеров колыбаху.

Немного вдавив рукой основание древа, я смог кое как добраться до туалета по пути словив с десяток жадных взглядов.

Когда я выходил из туалета, то возле него стояла буквально очередь из женщин, которые буквально вертелась от возбуждения.

Следующая остановка была уже под утро. Я вышел размяться, на мне была косоворотка и шорты. Ко мне подошла пожилая пара, мужчина и женщина под 60 лет, мужчина держал в руках небольшую подушку. Он спросил не жарко ли, после чего сказал, что его жена умеет делать расслабляющий массаж ног. Я сказал, что круто, после чего он сказал, что она хочет сделать вам массаж, так как она массажист, и ей дискомофртно видеть как я мучаюсь. Надо сказать, что мы втроём стояли немного в стороне от всей толпы, в тени, была ночь и нас не было видно Не успел я ничего ответить, как мужчина положил подушечку на пол, а женщина встала колени и начала мять икры. Было довольно приятно, но спустя буквально 30 секунд, я понял, что она трётся головой о мой член, который сразу колыхнулся ей навстречу. И буквально в следующий момент, она вытащила член из шорт и начала сосать. Я будучи в шоке от неожиданности, молчал, а мужчина смотрел по сторонам. Женщина хорошо сосалась, и я быстро финишировал ей на лицо и в рот. Тут раздался голос водителя. Отправление через 5 минут. Женщина встала, взяла подушку и сразу же ушла. А я немного успокоившись пошёл следом за странной парочкой.

После чего автобус поехал и я заснул. Проснулся уже после Ростова, автобус был полупустой, видимо все вышли в РнД. Женщины с мужем тоже не было.

Самое интересное я особо их и не запомнил. Было довольно темно, плюс все случилось как бы спросонья. Поэтому имейте в виду, кто ездит, что может быть\n''', Colors.red_to_yellow, interval=0.001)

def anal_sex():
	pystyle.Write.Print('''
Топ-5 правил анального секса для начинающих
Анальный секс больше не считается запретной темой, однако многие женщины до сих пор уверяют, что это настоящая пытка. Прежде чем пробовать что-то новое, необходимо досконально изучить вопрос. Анальный секс без должной подготовки и знаний всех нюансов действительно не принесет удовольствия, однако если подойди к эксперименту правильно, то все может пройти максимально удачно.
Топ-5 правил анального секса для начинающих
Анальный секс — тайная фантазия многих мужчин и открытая боль женщин. Секс коуч, основатель школы интимной гимнастики Вагимагия Екатерина Бибишева специально для Wanna Sex рассказала о том, как практиковать его с минимальными потерями.

Чем может быть опасен анальный секс?
По роду деятельности я толерантна практически к любым проявлениям сексуальности в половозрелых отношениях. Если оба партнера получают удовольствие в процессе и действуют, опираясь на принцип согласия — это ли не идеальный союз?! Наверное, еще и поэтому мне претят некоторые запретительные меры. Например, в Саудовской Аравии и в странах Африки за анальный секс карают смертной казнью. Есть государства, где за анальные эксперименты полагается тюремный срок от 10 лет до пожизненного. При всем при этом спрос на страпоны и игрушки для анального секса вот стабильно растет. Кроме того, анальный секс практикуют, как средство сохранения девственности - все в тех же странах с суровым законодательством. Вот почему я не вижу смысла в таких ультимативных запретах: то, что не разрешено, хочется сильнее. А ведь анальный секс достаточно травмоопасен.

Во-первых, высок риск подцепить ИППП.
Второе — это большая вероятность развития инфекции: природные бактерии прямой кишки попадают в ранки и провоцируют неприятные последствия.
Третье — ослабление сфинктера: анус будет слабеть с каждым разом, появится зияние и однажды женщина может не удержать газы или каловые массы.
Поэтому я всегда советую дамам хорошенько подумать, прежде чем соглашаться на опасный эксперимент. Ну и, конечно, заниматься анальным сексом стоит только с согласия обоих партнеров и с соблюдением техники безопасности.

Безопасный анальный секс — он какой?
Не травматичный, комфортный и желанный для двоих. Я приготовила для вас инструкцию, чтобы необычный эксперимент был комфортен для вас обоих.

Первое правило — всегда используйте презерватив. Помните о бактериях и вирусных возбудителях, которые передаются через слизистую оболочку прямой кишки.

Второе правило — всегда используйте лубриканты на силиконовой основе. Они долго не высыхают и уменьшают риск травмирования ануса. Некоторые секс-коучи рекомендуют смазки с анестетиком, но только не я. Если вы купируете боль, то не сможете услышать сигналы организма и получите травму.

Третье правило — анальный секс ни в коем случае не должен сопровождаться болью. При ее появлении сразу остановите партнера и не продолжайте эксперимент.

Четвертое правило — не забудьте подготовиться к анальному сексу, физически и психологически. Можно сделать анальный душ. Это небольшая резиновая груша, которую вы найдете в аптеке. Наполните ее теплой водой и аккуратно направьте струю воды внутрь себя. А партнеру расскажите о предварительных ласках. Сначала партнер нежно гладит сфинктер и стимулирует клитор. Потом прорабатывает сфинктер одним пальцем. Как бы подготавливает его к пенетрации.

Пятое правило — выбирайте безопасную позу. Самая удобная — это когда вы лежите на боку с поджатыми к груди коленями. Так называемая поза эмбриона. Партнер в этом случае также лежит на боку позади вас. В этом положении вы самостоятельно контролируете действия мужчины. И угол вхождения члена менее травматичен.

Ну и не забывайте главное правило: не чередовать анальный секс с вагинальным.

И пожалуйста не принуждайте себя. Если не готовы психологически, есть страхи, медицинские противопоказания, боль — не занимайтесь анальным сексом. Очень маленький процент женщин по настоящему испытывает приятные ощущения во время анального секса, в основном они терпят чтобы доставить удовольствие мужчине. Не навредите себе.

Почему мужчинам так нравится анальный секс?
Все из-за ощущения узости в анусе. Такова наша физиология: вагинальные мышцы постепенно ослабевают, особенно после родов и уже не могут плотно обхватить член. Мышцы ануса намного сильнее, и даже фрикции иногда не нужны, чтобы мужчина получил оргазм. Кстати, эластичность мышц можно восстановить с помощью интимной гимнастики. Тогда желанная узость вернется, а еще с помощью интимной гимнастики и дыхательным упражнениям можно выполнять чувственные техники секса — поцелуй Гейши или помпур. Ощущения у мужчины будут просто невероятные. И даже тугой анус уже не сможет составить конкуренцию вашей вагине.\n''', Colors.red_to_yellow, interval=0.001)

def pornoakt():
	pystyle.Write.Print('''а ты знаешь что там групповуха без резины долго потом лечитси придетси
Очень трудно пробиться в этот бизнес мужчинам. Вы должны быть готовы возбудиться в любой момент, оставаться в таком состоянии необходимое количество времени и эякулировать по команде режиссера. И никаких компромиссов. Размер полового члена должен быть большим в диаметре и, как минимум, 20- 25 см в длину. От актера также требуется хорошая физическая форма, выносливость, работоспособность и готовность в любой момент заняться сексом или прервать акт.

Простой рассылкой своих фотографий вы ничего не добьетесь. Вы должны лично прийти в студию и показаться профессионалам. Вас сфотографируют в обнаженном виде, рассмотрят вашу кандидатуру и свяжутся позже если вы подойдете. Но даже в этом случае шансы попасть в порно-бизнес минимальны. Всегда существует рынок порно-актеров, независимо от биографии и личных качеств, но в то же время у вас обязательно должны присутствовать: 1) талант 2) удача 3) выгодное место жительства. В Нью-Йорке, Майами, Сан-Франциско, Лондоне, Амстердаме, Праге, Будапеште, Торонто есть хорошие порно-студии, но 95% самых известных порно фильмов в мире выпускаются в порно-долине Сан-Фернандо (Южная Калифорния, США) . Чем дальше от этого места вы живете, тем меньше ваши шансы стать порно-звездой.

Если вы попали в порно-долину, обратитесь в такие студии как VCA Platinum, Elegant Angel, Metro or Wicked (в Чатсворте) , Vivid (в Ван Нуйс) или Sin City (в Канога парке) . Но шансы, что вас возьмут сниматься в порно-фильмах без кастингов и предварительных просмотров очень малы.

Если вы просто хотите заработать участием в малобюджетных интернет порно-клипах, вы можете воспользоваться поисковиками, типа yahoo или google. Вместо того, чтобы просматривать предложения о работе, поищите лучше сайты, где вы можете посмотреть и выбрать, что больше всего из предложенного вам подходит и где у вас больше всего шансов. Затем убедитесь, что порно выпускается именно самим сайтом и только для него и свяжитесь с владельцами и разработчиками сайта, чтобы обсудить все условия. В этом случае, вы должны разместить свои фото и личную информацию в интернете.\n''', Colors.red_to_yellow, interval=0.001)

def info():
	pystyle.Write.Print('''Самый крутой софт в мире\nПодойдет для пробива очка\nМои братки t.me/happispython\nV1\nСлава культу Wanna!!!!!!\n''', Colors.red_to_yellow, interval=0.001)
	

def sup():
	pystyle.Write.Print('''@Send: http://t.me/send?start=IVwESioWXEzz
ЭЩКЕРЕ\n''', Colors.red_to_yellow, interval=0.001)



def main_menu():
    while True:
        os.system('cls' if os.name == 'nt' else 'clear')
        banner = '''██╗    ██╗ █████╗ ███╗   ██╗███╗   ██╗ █████╗     ███████╗███████╗██╗  ██╗
██║    ██║██╔══██╗████╗  ██║████╗  ██║██╔══██╗    ██╔════╝██╔════╝╚██╗██╔╝
██║ █╗ ██║███████║██╔██╗ ██║██╔██╗ ██║███████║    ███████╗█████╗   ╚███╔╝ 
██║███╗██║██╔══██║██║╚██╗██║██║╚██╗██║██╔══██║    ╚════██║██╔══╝   ██╔██╗ 
╚███╔███╔╝██║  ██║██║ ╚████║██║ ╚████║██║  ██║    ███████║███████╗██╔╝ ██╗
 ╚══╝╚══╝ ╚═╝  ╚═╝╚═╝  ╚═══╝╚═╝  ╚═══╝╚═╝  ╚═╝    ╚══════╝╚══════╝╚═╝  ╚═╝
                   [+] by westttik | @happispython [+]
                     
 1.Урок по мастурбации для мужчин          2.Урок по мастурбации для женщин
 3.Базовые правила секса                   4.Как стать жертвой насилия
 5.Правильный  минет                       6.Курс по кунилингусу
 7.Каким должен быть первый секс           8.Анальный секс
 9.История о сексе                         10.Как стать порноактером
 333.Информация                            444.Поддержать меня
                              666.Выйти
        
        '''
        Write.Print(Center.XCenter(banner), Colors.red_to_yellow, interval=0.001)
        
        choice = pystyle.Write.Input("\n[*] Выберите пункт меню: ", Colors.red_to_yellow, interval=0.001)
        if choice == '1':
        	mastur_2()
        	pystyle.Write.Input("Нажмите Enter для продолжения...", Colors.red_to_yellow, interval=0.001)
        elif choice == '2':
        	mastur_1()
        	pystyle.Write.Input("Нажмите Enter для продолжения...", Colors.red_to_yellow, interval=0.001)
        elif choice == '3':
        	base_sex()
        	pystyle.Write.Input("Нажмите Enter для продолжения...", Colors.red_to_yellow, interval=0.001)
        elif choice == '4':
        	nasil()
        	pystyle.Write.Input("Нажмите Enter для продолжения...", Colors.red_to_yellow, interval=0.001)
        elif choice == '5':
        	minet()
        	pystyle.Write.Input("Нажмите Enter для продолжения...", Colors.red_to_yellow, interval=0.001)
        elif choice == '6':
        	kuni()
        	pystyle.Write.Input("Нажмите Enter для продолжения...", Colors.red_to_yellow, interval=0.001)
        elif choice == '7':
        	pervi_sex()
        	pystyle.Write.Input("Нажмите Enter для продолжения...", Colors.red_to_yellow, interval=0.001)
        elif choice == '8':
        	anal_sex()
        	pystyle.Write.Input("Нажмите Enter для продолжения...", Colors.red_to_yellow, interval=0.001)
        elif choice == '9':
        	his_sex()
        	pystyle.Write.Input("Нажмите Enter для продолжения...", Colors.red_to_yellow, interval=0.001)
        elif choice == '10':
        	pornoakt()
        	pystyle.Write.Input("Нажмите Enter для продолжения...", Colors.red_to_yellow, interval=0.001)
        elif choice == '333':
        	info()
        	pystyle.Write.Input("Нажмите Enter для продолжения...", Colors.red_to_yellow, interval=0.001)
        elif choice == '444':
        	sup()
        	pystyle.Write.Input("Нажмите Enter для продолжения...", Colors.red_to_yellow, interval=0.001)
        elif choice == '666':
        	pystyle.Write.Print("Выход...", Colors.red_to_yellow, interval=0.001)
        	break
        
        	
        else:
            pystyle.Write.Print("Некорректный ввод. Пожалуйста, выберите пункт из меню.", Colors.red_to_yellow, interval=0.001)
            pystyle.Write.Input("Нажмите Enter для продолжения...", Colors.red_to_yellow, interval=0.001)

if __name__ == "__main__":
    main_menu()